export interface PastTenseVerb {
    irregularity: 'مهموز' | 'مثال' | 'أجوف' | 'مضاعف' | 'مضاعف' | 'ناقص' | 'لفيف';
    type: 'passive' | 'active';
    pattern: 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10;
    table: string[];
}

export const pastTenseVerbs: PastTenseVerb[] = [
    {
        irregularity: 'مهموز',
        type: 'active',
        pattern: 2,
        table: [
            'أَخَّرَ',
            'أَخَّرَا',
            'أَخَّرُوْا',
            'أَخَّرَتْ',
            'أَخَّرَتَا',
            'أَخَّرْنَ',
            'أَخَّرْتَ',
            'أَخَّرْتُمَا',
            'أَخَّرْتُمْ',
            'أَخَّرْتِ',
            'أَخَّرْتُمَا',
            'أَخَّرْتُنَّ',
            'أَخَّرْتُ',
            'أَخَّرْنَا'
        ]
    },
    {
        irregularity: 'مهموز',
        type: 'passive',
        pattern: 2,
        table: [
            'أُخِّرَ',
            'أُخِّرَا',
            'أُخِّرُوْا',
            'أُخِّرَتْ',
            'أُخِّرَتَا',
            'أُخِّرْنَ',
            'أُخِّرْتَ',
            'أُخِّرْتُمَا',
            'أُخِّرْتُمْ',
            'أُخِّرْتِ',
            'أُخِّرْتُمَا',
            'أُخِّرْتُنَّ',
            'أُخِّرْتُ',
            'أُخِّرْنَا'
        ]
    }
];
