export interface SarfPattern {
    value: PatternId;
    label: string;
    table: string[] | { [key: string]: string[] };
}

export type PatternId = '1' | '2' | '3' | '4' | '5' | '6' | '7' | '8' | '9' | '10';
export type BabId = 'ن' | 'ف' | 'ض' | 'س' | 'ح' | 'ك';

export const babs: BabId[] = ['ن', 'ف', 'ض', 'س', 'ح', 'ك'];

export const sarfPatterns: SarfPattern[] = [
    {
        value: '1',
        label: 'Pattern 1',
        table: {
            ن: [
                'نَصَرَ',
                'يَنْصُرُ',
                'نَصْرًا',
                'نَاصِرٌ',
                'نُصِرَ',
                'يُنْصَرُ',
                'نَصْرًا',
                'مَنْصُوْرٌ',
                'اُنْصُرْ',
                'لا تَنْصُرْ',
                'مَنْصِرٌ مَنْصَرٌ مَنْصَرَةٌ',
                'مِنْصَرٌ مِنْصَرَةٌ مِنْصَارٌ'
            ],
            ف: [
                'فَتَحَ',
                'يَفْتَحُ',
                'فَتْحًا',
                'فَاتِحٌ',
                'فُتِحَ',
                'يُفْتَحُ',
                'فَتْحًا',
                'مَفْتُوْحٌ',
                'اِفْتَحْ',
                'لَا تَفْتَحْ',
                'مَفْتِحٌ مَفْتَحٌ مَفْتَحَةٌ',
                'مِفْتَحٌ مِفْتَحَةٌ مِفْتَاحٌ'
            ],
            ض: [
                'ضَرَبَ',
                'يَضْرِبُ',
                'ضَرْبًا',
                'ضَارِبٌ',
                'ضُرِبَ',
                'يُضْرَبُ',
                'ضَرْبًا',
                'مَضْرُوْبٌ',
                'اِضْرِبْ',
                'لا تَضْرِبْ',
                'مَضْرِبٌ مَضْرَبٌ مَضْرَبَةٌ',
                'مِضْرَبٌ مِضْرَبَةٌ مِضْرَابٌ'
            ],
            س: [
                'سَمِعَ',
                'يَسْمَعُ',
                'سَمْعًا',
                'سَامِعٌ',
                'سُمِعَ',
                'يُسْمَعُ',
                'سَمْعًا',
                'مَسْمُوْعٌ',
                'اِسْمَعْ',
                'لا تَسْمَعْ',
                'مَسْمِعٌ مَسْمَعٌ مَسْمَعَةٌ',
                'مِسْمَعٌ مِسْمَعَةٌ مِسْمَاعٌ'
            ],
            ح: [
                'حَسِبَ',
                'يَحْسِبُ',
                'حِسْبَانًا',
                'حَاسِبٌ',
                'حُسِبَ',
                'يُحْسَبُ',
                'حِسْبَانًا',
                'مَحْسُوْبٌ',
                'اِحْسِبْ',
                'لا تَحْسِبْ',
                'مَحْسِبٌ مَحْسَبٌ مَحْسَبَةٌ',
                'مِحْسَبٌ مِحْسَبَةٌ مِحْسَابٌ'
            ],
            ك: [
                'كَرُمَ',
                'يَكْرُمُ',
                'كَرَامَةً',
                'كَرِيْمٌ',
                '',
                '',
                '',
                '',
                'اُكْرُمْ',
                'لا تَكْرُمْ',
                'مَكْرِمٌ مَكْرَمٌ مَكْرَمَةٌ',
                'مِكْرَمٌ مِكْرَمَةٌ مِكْرَامٌ'
            ]
        }
    },
    {
        value: '2',
        label: 'Pattern 2',
        table: [
            'فَعَّلَ',
            'يُفَعِّلُ',
            'تَفْعِيْلًا',
            'مُفَعِّلٌ',
            'فُعِّلَ',
            'يُفَعَّلُ',
            'تَفْعِيْلًا',
            'مُفَعَّلٌ',
            'فَعِّلْ',
            'لا تُفَعِّلْ',
            'مُفَعَّلٌ'
        ]
    },
    {
        value: '3',
        label: 'Pattern 3',
        table: [
            'فَاعَلَ',
            'يُفَاعِلُ',
            'فِعَالًا مُفَاعَلَةً',
            'مُفَاعِلٌ',
            'فُوْعِلَ',
            'يُفَاعَلُ',
            'فِعَالًا مُفَاعَلَةً',
            'مُفَاعَلٌ',
            'فَاعِلْ',
            'لا تُفَاعِلْ',
            'مُفَاعَلٌ'
        ]
    },
    {
        value: '4',
        label: 'Pattern 4',
        table: [
            'أَفْعَلَ',
            'يُفْعِلُ',
            'إِفْعَالًا',
            'مُفْعِلٌ',
            'أُفْعِلَ',
            'يُفْعَلُ',
            'إِفْعَالًا',
            'مُفْعَلٌ',
            'أَفْعِلْ',
            'لا تُفْعِلْ',
            'مُفْعَلٌ'
        ]
    },
    {
        value: '5',
        label: 'Pattern 5',
        table: [
            'تَفَعَّلَ',
            'يَتَفَعَّلُ',
            'تَفَعُّلًا',
            'مُتَفَعِّلٌ',
            'تُفُعِّلَ',
            'يُتَفَعَّلُ',
            'تَفَعُّلًا',
            'مُتَفَعَّلٌ',
            'تَفَعَّلْ',
            'لا تَتَفَعَّلْ',
            'مُتَفَعَّلٌ'
        ]
    },
    {
        value: '6',
        label: 'Pattern 6',
        table: [
            'تَفَاعَلَ',
            'يَتَفَاعَلُ',
            'تَفَاعُلًا',
            'مُتَفَاعِلٌ',
            'تُفُوْعِلَ',
            'يُتَفَاعَلُ',
            'تَفَاعُلًا',
            'مُتَفَاعَلٌ',
            'تَفَاعَلْ',
            'لا تَتَفَاعَلْ',
            'مُتَفَاعَلٌ'
        ]
    },
    {
        value: '7',
        label: 'Pattern 7',
        table: [
            'اِنْفَعَلَ',
            'يَنْفَعِلُ',
            'اِنْفِعَالًا',
            'مُنْفَعِلٌ',
            '',
            '',
            '',
            '',
            'اِنْفَعِلْ',
            'لا تَنْفَعِلْ',
            'مُنْفَعَلٌ'
        ]
    },
    {
        value: '8',
        label: 'Pattern 8',
        table: [
            'اِفْتَعَلَ',
            'يَفْتَعِلُ',
            'اِفْتِعَالًا',
            'مُفْتَعِلٌ',
            'اُفْتُعِلَ',
            'يُفْتَعَلُ',
            'اِفْتِعَالًا',
            'مُفْتَعَلٌ',
            'اِفْتَعِلْ',
            'لا تَفْتَعِلْ',
            'مُفْتَعَلٌ'
        ]
    },
    {
        value: '9',
        label: 'Pattern 9',
        table: [
            'اِفْعَلَّ',
            'يَفْعَلُّ',
            'اِفْعِلَالًا',
            'مُفْعَلٌّ',
            '',
            '',
            '',
            '',
            'اِفْعَلِلْ',
            'لا تَفْعَلِلْ',
            'مُفْعَلٌّ'
        ]
    },
    {
        value: '10',
        label: 'Pattern 10',
        table: [
            'اِسْتَفْعَلَ',
            'يَسْتَفْعِلُ',
            'اِسْتِفْعَالًا',
            'مُسْتَفْعِلٌ',
            'اُسْتُفْعِلَ',
            'يُسْتَفْعَلُ',
            'اِسْتِفْعَالًا',
            'مُسْتَفْعَلٌ',
            'اِسْتَفْعِلْ',
            'لا تَسْتَفْعِلْ',
            'مُسْتَفْعَلٌ'
        ]
    }
];
